In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [5]:
df['FlightNumber'].interpolate(method = 'linear', inplace = True)

In [6]:
df['FlightNumber'] = df['FlightNumber'].astype('int64')

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [8]:
temp_df = df['From_To'].str.split('_', expand = True)
temp_df.columns = ['From', 'To']
temp_df = temp_df.applymap(lambda x: x.title())
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [9]:
df.drop(columns = ['From_To'], inplace = True)
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [10]:
df = temp_df.join(df)
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

In [11]:
temp_df = pd.DataFrame(df['RecentDelays'].to_list(), columns = ['Delay_1', 'Delay_2', 'Delay_3'])
df = df.join(temp_df)

In [12]:
df.drop(columns = ['RecentDelays'], inplace = True)

In [13]:
df.columns

Index(['From', 'To', 'FlightNumber', 'Airline', 'Delay_1', 'Delay_2',
       'Delay_3'],
      dtype='object')

In [14]:
df=df[['From', 'To', 'FlightNumber', 'Delay_1', 'Delay_2', 'Delay_3', 'Airline']]

In [15]:
df.isnull()

    From     To  FlightNumber  Delay_1  Delay_2  Delay_3  Airline
0  False  False         False    False    False     True    False
1  False  False         False     True     True     True    False
2  False  False         False    False    False    False    False
3  False  False         False    False     True     True    False
4  False  False         False    False    False     True    False

In [16]:
df

,From,To,FlightNumber,Delay_1,Delay_2,Delay_3,Airline
0,London,Paris,10045,23.0,47.0,NaN,KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,<Air France> (12)
2,London,Stockholm,10065,24.0,43.0,87.0,(British Airways. )
3,Budapest,Paris,10075,13.0,NaN,NaN,12. Air France
4,Brussels,London,10085,67.0,32.0,NaN,"""Swiss Air"""